In [50]:
import pandas as pd
from tabula.io import read_pdf

In [2]:
dataset1 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_1.csv')
dataset1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [3]:
dataset1.columns

Index(['Bedroom', ' Sq. foot', ' Locality', ' Price ($)'], dtype='object')

In [4]:
dataset1.set_index(' Sq. foot')

           Bedroom    Locality   Price ($)
 Sq. foot
1500             2        Good      300000
1300             3        Fair      240000
1900             3   Very good      450000
1850             3         Bad      280000
1640             2        Good      310000

In [5]:
dataset2 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_2.csv')
dataset2

   2   1500        Good   300000
0  3   1300        Fair   240000
1  3   1900   Very good   450000
2  3   1850         Bad   280000
3  2   1640        Good   310000

In [6]:
dataset2_1 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_2.csv', header=None)
dataset2_1

   0     1           2       3
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [7]:
header = ['Bedroom', 'Sq. foot', 'Locality', 'Price ($)']
dataset2_2 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_2.csv', names=header)
dataset2_2

   Bedroom  Sq. foot    Locality  Price ($)
0        2      1500        Good     300000
1        3      1300        Fair     240000
2        3      1900   Very good     450000
3        3      1850         Bad     280000
4        2      1640        Good     310000

In [8]:
dataset3 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_3.csv')
dataset3

  Bedroom; Sq. foot; Locality; Price ($)
0                  2; 1500; Good; 300000
1                  3; 1300; Fair; 240000
2             3; 1900; Very good; 450000
3                   3; 1850; Bad; 280000
4                  2; 1640; Good; 310000

In [9]:
dataset3 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_3.csv', sep=';')
dataset3

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [10]:
dataset4 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_1.csv',
                       header=0, names=['col1', 'col2', 'col3', 'col4'])
dataset4

   col1  col2        col3    col4
0     2  1500        Good  300000
1     3  1300        Fair  240000
2     3  1900   Very good  450000
3     3  1850         Bad  280000
4     2  1640        Good  310000

In [11]:
dataset5 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_skiprows.csv')
dataset5

  Filetype: CSV              Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN  Info about some houses         NaN         NaN
1       Bedroom                Sq. foot    Locality   Price ($)
2             2                    1500        Good      300000
3             3                    1300        Fair      240000
4             3                    1900   Very good      450000
5             3                    1850         Bad      280000
6             2                    1640        Good      310000

In [12]:
dataset5_1 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_skiprows.csv', skiprows=2)
dataset5_1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [13]:
dataset5_2 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_skipfooter.csv')
dataset5_2

  Filetype: CSV                Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN    Info about some houses         NaN         NaN
1       Bedroom                  Sq. foot    Locality   Price ($)
2             2                      1500        Good      300000
3             3                      1300        Fair      240000
4             3                      1900   Very good      450000
5             3                      1850         Bad      280000
6             2                      1640        Good      310000
7           NaN   This is the end of file         NaN         NaN

In [14]:
dataset5_2 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_skipfooter.csv',
                         skiprows=2, skipfooter=1, engine='python')
dataset5_2

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [15]:
dataset_chunks = []
rows_in_chunk = 10
num_of_chunk = 5
columns = pd.read_csv('../../Chapter05/Exercise60-68/Boston_housing.csv', nrows=5).columns

for i in range(0, num_of_chunk*rows_in_chunk, rows_in_chunk):
    data = pd.read_csv('../../Chapter05/Exercise60-68/Boston_housing.csv',
                       header=0, skiprows=i, nrows=num_of_chunk, names=columns)
    dataset_chunks.append(data)

dataset_chunks[0]

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
0,0.00632,18,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [16]:
dataset6 = pd.read_csv('../../Chapter05/Exercise60-68/CSV_EX_1.zip')
dataset6

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [18]:
dataset7_1 = pd.read_excel('../../Chapter05/Exercise60-68/Housing_data.xlsx',
                           sheet_name='Data_Tab_1')
dataset7_2 = pd.read_excel('../../Chapter05/Exercise60-68/Housing_data.xlsx',
                           sheet_name='Data_Tab_2')
dataset7_3 = pd.read_excel('../../Chapter05/Exercise60-68/Housing_data.xlsx',
                           sheet_name='Data_Tab_3')

In [19]:
dataset7_1

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222,18.7,394.12,5.21,28.7
6,0.08829,12.5,7.87,0,0.524,6.012,66.6,5.5605,5,311,15.2,395.60,12.43,22.9
7,0.14455,12.5,7.87,0,0.524,6.172,96.1,5.9505,5,311,15.2,396.90,19.15,27.1
8,0.21124,12.5,7.87,0,0.524,5.631,100.0,6.0821,5,311,15.2,386.63,29.93,16.5

In [20]:
dataset7_2

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
0,0.17004,12.5,7.87,0,0.524,6.004,85.9,6.5921,5,311,15.2,386.71,17.10,18.9
1,0.22489,12.5,7.87,0,0.524,6.377,94.3,6.3467,5,311,15.2,392.52,20.45,15.0
2,0.11747,12.5,7.87,0,0.524,6.009,82.9,6.2267,5,311,15.2,396.90,13.27,18.9
3,0.09378,12.5,7.87,0,0.524,5.889,39.0,5.4509,5,311,15.2,390.50,15.71,21.7

In [21]:
dataset7_3

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
0,0.72580,0,8.14,0,0.538,5.727,69.5,3.7965,4,307,21,390.95,11.28,18.2
1,1.25179,0,8.14,0,0.538,5.570,98.1,3.7979,4,307,21,376.57,21.02,13.6
2,0.85204,0,8.14,0,0.538,5.965,89.2,4.0123,4,307,21,392.53,13.83,19.6
3,1.23247,0,8.14,0,0.538,6.142,91.7,3.9769,4,307,21,396.90,18.72,15.2
4,0.98843,0,8.14,0,0.538,5.813,100.0,4.0952,4,307,21,394.54,19.88,14.5
5,0.75026,0,8.14,0,0.538,5.924,94.1,4.3996,4,307,21,394.33,16.30,15.6
6,0.84054,0,8.14,0,0.538,5.599,85.7,4.4546,4,307,21,303.42,16.51,13.9
7,0.67191,0,8.14,0,0.538,5.813,90.3,4.6820,4,307,21,376.88,14.81,16.6
8,0.95577,0,8.14,0,0.538,6.047,88.8,4.4534,4,307,21,306.38,17.28,14.8
9,0.77299,0,8.14,0,0.538,6.495,94.4,4.4547,4,307,21,387.94,12.80,18.4
10,0.62976,0,8.14,0,0.538,5.949,61.8,4.7075,4,307,21,396.90,8.26,20.4
11,0.63796,0,8.14,0,0.538,6.096,84.5,4.4619,4,307,21,380.02,10.26,18.2
12,0.62739,0,8.14,0,0.538,5.834,56.5,4.4986,4,307,21,395.62,8.47,19.9
13,1.05393,0,8.14,0,0.538,5.935,29.3,4.4986,4,307,21,386.85,6.58,23.1
14,0.78420,0,8.14,0,0.538,5.990,81.7,4.2579,4,307,21,386.75,14.67,17.5
15,0.80271,0,8.14,0,0.538,5.456,36.6,3.7965,4,307,21,288.99,11.69,20.2

In [22]:
dataset8 = pd.read_table('../../Chapter05/Exercise60-68/Table_EX_1.txt')
dataset8

  Bedroom, Sq. foot, Locality, Price ($)
0                  2, 1500, Good, 300000
1                  3, 1300, Fair, 240000
2             3, 1900, Very good, 450000
3                   3, 1850, Bad, 280000
4                  2, 1640, Good, 310000

In [23]:
dataset8_1 = pd.read_table('../../Chapter05/Exercise60-68/Table_EX_1.txt',
                           sep=',')
dataset8_1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [27]:
dataset9 = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
dataset9[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [29]:
dataset10 = pd.read_html('https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table', header=0)
dataset10[1]

                Rank                         NOC  Gold  Silver  Bronze  Total
0                  1         United States(USA)    46      37      38    121
1                  2         Great Britain(GBR)    27      23      17     67
2                  3                 China(CHN)    26      18      26     70
3                  4                Russia(RUS)    19      17      20     56
4                  5               Germany(GER)    17      10      15     42
..               ...                         ...   ...     ...     ...    ...
82                78               Nigeria(NGR)     0       0       1      1
83                78              Portugal(POR)     0       0       1      1
84                78   Trinidad and Tobago(TTO)     0       0       1      1
85                78  United Arab Emirates(UAE)     0       0       1      1
86  Totals (86 NOCs)            Totals (86 NOCs)   307     307     359    973

[87 rows x 6 columns]

In [30]:
dataset11 = pd.read_json('../../Chapter05/Exercise60-68/movies.json')
dataset11

,title,year,cast,genres
0,After Dark in Central Park,1900,[],[]
1,Boarding School Girls' Pajama Parade,1900,[],[]
2,Buffalo Bill's Wild West Parad,1900,[],[]
3,Caught,1900,[],[]
4,Clowns Spinning Hats,1900,[],[]
...,...,...,...,...
28790,Bumblebee,2018,"[Hailee Steinfeld, John Cena, Jorge Lendeborg ...","[Action, Adventure, Science Fiction]"
28791,Welcome to Marwen,2018,"[Steve Carell, Leslie Mann, Diane Kruger, Falk...","[Fantasy, Drama]"
28792,Holmes and Watson,2018,"[Will Ferrell, John C. Reilly, Rebecca Hall, R...","[Action, Mystery, Comedy]"
28793,On the Basis of Sex,2018,"[Felicity Jones, Armie Hammer, Justin Theroux,...","[Biography, Drama]"
28794,Destroyer,2018,"[Nicole Kidman, Tatiana Maslany, Sebastian Sta...","[Crime, Thriller]"

In [31]:
dataset12 = pd.read_stata('../../Chapter05/Exercise60-68/wu-data.dta')
dataset12

,id,year,province,totalpop,totalso2,reg_GDP,time,treatment,provincearea,group,SO2PC,SO2PGDP,GDPPC,GDPPC2,pop_density
0,Beijing,1991,Beijing,1094.0,210000,598.900024,1.0,0,16800,1,191.956131,191.956131,0.547441,0.299691,0.065119
1,Beijing,1992,Beijing,1102.0,200000,709.099976,2.0,0,16800,1,181.488205,181.488205,0.643466,0.414049,0.065595
2,Beijing,1993,Beijing,1112.0,203736,863.530029,3.0,0,16800,1,183.215820,183.215820,0.776556,0.603039,0.066190
3,Beijing,1994,Beijing,1125.0,175616,1084.030029,4.0,0,16800,1,156.103104,156.103104,0.963582,0.928491,0.066964
4,Beijing,1995,Beijing,1251.0,214899,1394.890015,5.0,0,16800,1,171.781769,171.781769,1.115020,1.243270,0.074464
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
505,Zhejiang,2003,Zhejiang,4680.0,707271,9705.019531,13.0,0,101800,0,151.126282,151.126282,2.073722,4.300323,0.045972
506,Zhejiang,2004,Zhejiang,4720.0,789000,11648.700195,14.0,0,101800,0,167.161011,167.161011,2.467945,6.090752,0.046365
507,Zhejiang,2005,Zhejiang,4898.0,831000,15742.509766,15.0,0,101800,0,169.661087,169.661087,3.214069,10.330239,0.048114
508,Zhejiang,2006,Zhejiang,4980.0,829000,15742.509766,16.0,0,101800,0,166.465866,166.465866,3.161147,9.992848,0.048919
509,Zhejiang,2007,Zhejiang,5060.0,775000,18780.439453,17.0,0,101800,0,153.162048,153.162048,3.711549,13.775599,0.049705

In [55]:
dataset13 = read_pdf('../../Chapter05/Exercise60-68/Housing_data.pdf',
                         pages=[1], pandas_options={'header':None})
dataset13[0]

         0     1     2  3      4      5     6       7  8    9
0  0.17004  12.5  7.87  0  0.524  6.004  85.9  6.5921  5  311
1  0.22489  12.5  7.87  0  0.524  6.377  94.3  6.3467  5  311
2  0.11747  12.5  7.87  0  0.524  6.009  82.9  6.2267  5  311
3  0.09378  12.5  7.87  0  0.524  5.889  39.0  5.4509  5  311